Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: والذين يقولون ربنا هب لنا من أزواجنا وذرياتنا قرة أعين واجعلنا للمتقين إماما
en: And those who say, "Our Lord, grant us from among our wives and offspring comfort to our eyes and make us an example for the righteous."

source: أولئك يجزون الغرفة بما صبروا ويلقون فيها تحية وسلاما
en: Those will be awarded the Chamber for what they patiently endured, and they will be received therein with greetings and [words of] peace.

source: خالدين فيها حسنت مستقرا ومقاما
en: Abiding eternally therein. Good is the settlement and residence.

source: قل ما يعبأ بكم ربي لولا دعاؤكم فقد كذبتم فسوف يكون لزاما
en: Say, "What would my Lord care for you if not for your supplication?" For you [disbelievers] have denied, so your denial is going to be adherent.

source: طسم
en: Ta, Seen, Meem.

source: تلك آيات الكتاب المبين
en: These are the verses of the clear Book.

source: لعلك باخع نفسك ألا يكونوا مؤمنين
en: Perhaps, [O Muhammad], you would kill yourself with grief that they will not be believers.

source: إن نشأ ننزل عليهم من السماء آية فظلت أعناقهم لها خاضعين
en: If We willed, We could send down to them from the sky a sign for which their necks would remain humbled.

source: وما يأتيهم من ذكر من الرحمن محدث إلا كانوا عنه معرضين
en: And no revelation comes to them anew from the Most Merciful except that they turn away from it.

source: فقد كذبوا فسيأتيهم أنباء ما كانوا به يستهزئون
en: For they have already denied, but there will come to them the news of that which they used to ridicule.

source: أولم يروا إلى الأرض كم أنبتنا فيها من كل زوج كريم
en: Did they not look at the earth - how much We have produced therein from every noble kind?

source: إن في ذلك لآية وما كان أكثرهم مؤمنين
en: Indeed in that is a sign, but most of them were not to be believers.

source: وإن ربك لهو العزيز الرحيم
en: And indeed, your Lord - He is the Exalted in Might, the Merciful.

source: وإذ نادى ربك موسى أن ائت القوم الظالمين
en: And [mention] when your Lord called Moses, [saying], "Go to the wrongdoing people -

source: قوم فرعون ألا يتقون
en: The people of Pharaoh. Will they not fear Allah?"

source: قال رب إني أخاف أن يكذبون
en: He said, "My Lord, indeed I fear that they will deny me

source: ويضيق صدري ولا ينطلق لساني فأرسل إلى هارون
en: And that my breast will tighten and my tongue will not be fluent, so send for Aaron.

source: ولهم علي ذنب فأخاف أن يقتلون
en: And they have upon me a [claim due to] sin, so I fear that they will kill me."

source: قال كلا فاذهبا بآياتنا إنا معكم مستمعون
en: [Allah] said, "No. Go both of you with Our signs; indeed, We are with you, listening.

source: فأتيا فرعون فقولا إنا رسول رب العالمين
en: Go to Pharaoh and say, 'We are the messengers of the Lord of the worlds,

source: أن أرسل معنا بني إسرائيل
en: [Commanded to say], "Send with us the Children of Israel."'"

source: قال ألم نربك فينا وليدا ولبثت فينا من عمرك سنين
en: [Pharaoh] said, "Did we not raise you among us as a child, and you remained among us for years of your life?

source: وفعلت فعلتك التي فعلت وأنت من الكافرين
en: And [then] you did your deed which you did, and you were of the ungrateful."

source: قال فعلتها إذا وأنا من الضالين
en: [Moses] said, "I did it, then, while I was of those astray.

source: ففررت منكم لما خفتكم فوهب لي ربي حكما وجعلني من المرسلين
en: So I fled from you when I feared you. Then my Lord granted me wisdom and prophethood and appointed me [as one] of the messengers.

source: وتلك نعمة تمنها علي أن عبدت بني إسرائيل
en: And is this a favor of which you remind me - that you have enslaved the Children of Israel?"

source: قال فرعون وما رب العالمين
en: Said Pharaoh, "And what is the Lord of the worlds?"

source: قال رب السماوات والأرض وما بينهما إن كنتم موقنين
en: [Moses] said, "The Lord of the heavens and earth and that between them, if you should be convinced."

source: قال لمن حوله ألا تستمعون
en: [Pharaoh] said to those around him, "Do you not hear?"

source: قال ربكم ورب آبائكم الأولين
en: [Moses] said, "Your Lord and the Lord of your first forefathers."

source: قال إن رسولكم الذي أرسل إليكم لمجنون
en: [Pharaoh] said, "Indeed, your 'messenger' who has been sent to you is mad."

source: قال رب المشرق والمغرب وما بينهما إن كنتم تعقلون
en: [Moses] said, "Lord of the east and the west and that between them, if you were to reason."

source: قال لئن اتخذت إلها غيري لأجعلنك من المسجونين
en: [Pharaoh] said, "If you take a god other than me, I will surely place you among those imprisoned."

source: قال أولو جئتك بشيء مبين
en: [Moses] said, "Even if I brought you proof manifest?"

source: قال فأت به إن كنت من الصادقين
en: [Pharaoh] said, "Then bring it, if you should be of the truthful."

source: قال للملإ حوله إن هذا لساحر عليم
en: [Pharaoh] said to the eminent ones around him, "Indeed, this is a learned magician.

source: يريد أن يخرجكم من أرضكم بسحره فماذا تأمرون
en: He wants to drive you out of your land by his magic, so what do you advise?"

source: قالوا أرجه وأخاه وابعث في المدائن حاشرين
en: They said, "Postpone [the matter of] him and his brother and send among the cities gatherers

source: يأتوك بكل سحار عليم
en: Who will bring you every learned, skilled magician."

source: فجمع السحرة لميقات يوم معلوم
en: So the magicians were assembled for the appointment of a well-known day.

source: وقيل للناس هل أنتم مجتمعون
en: And it was said to the people, "Will you congregate

source: لعلنا نتبع السحرة إن كانوا هم الغالبين
en: That we might follow the magicians if they are the predominant?"

source: فلما جاء السحرة قالوا لفرعون أئن لنا لأجرا إن كنا نحن الغالبين
en: And when the magicians arrived, they said to Pharaoh, "Is there indeed for us a reward if we are the predominant?"

source: قال نعم وإنكم إذا لمن المقربين
en: He said, "Yes, and indeed, you will then be of those near [to me]."

source: قال لهم موسى ألقوا ما أنتم ملقون
en: Moses said to them, "Throw whatever you will throw."

source: فألقوا حبالهم وعصيهم وقالوا بعزة فرعون إنا لنحن الغالبون
en: So they threw their ropes and their staffs and said, "By the might of Pharaoh, indeed it is we who are predominant."

source: فألقى موسى عصاه فإذا هي تلقف ما يأفكون
en: Then Moses threw his staff, and at once it devoured what they falsified.

source: فألقي السحرة ساجدين
en: So the magicians fell down in prostration [to Allah].

source: قال آمنتم له قبل أن آذن لكم إنه لكبيركم الذي علمكم السحر فلسوف تعلمون لأقطعن أيديكم وأرجلكم من خلاف ولأصلبنكم أجمعين
en: [Pharaoh] said, "You believed Moses before I gave you permission. Indeed, he is your leader who has taught you magic, but you are going to know. I will surely cut off your hands and your feet on opposite sides, and I will surely crucify you all."

source: قالوا لا ضير إنا إلى ربنا منقلبون
en: They said, "No harm. Indeed, to our Lord we will return.

source: إنا نطمع أن يغفر لنا ربنا خطايانا أن كنا أول المؤمنين
en: Indeed, we aspire that our Lord will forgive us our sins because we were the first of the believers."

source: وأوحينا إلى موسى أن أسر بعبادي إنكم متبعون
en: And We inspired to Moses, "Travel by night with My servants; indeed, you will be pursued."

source: فأرسل فرعون في المدائن حاشرين
en: Then Pharaoh sent among the cities gatherers

source: إن هؤلاء لشرذمة قليلون
en: [And said], "Indeed, those are but a small band,

source: وإنهم لنا لغائظون
en: And indeed, they are enraging us,

source: وإنا لجميع حاذرون
en: And indeed, we are a cautious society... "

source: فأخرجناهم من جنات وعيون
en: So We removed them from gardens and springs

source: وكنوز ومقام كريم
en: And treasures and honorable station -

source: كذلك وأورثناها بني إسرائيل
en: Thus. And We caused to inherit it the Children of Israel.

source: فأتبعوهم مشرقين
en: So they pursued them at sunrise.

source: فلما تراءى الجمعان قال أصحاب موسى إنا لمدركون
en: And when the two companies saw one another, the companions of Moses said, "Indeed, we are to be overtaken!"

source: قال كلا إن معي ربي سيهدين
en: [Moses] said, "No! Indeed, with me is my Lord; He will guide me."

source: فأوحينا إلى موسى أن اضرب بعصاك البحر فانفلق فكان كل فرق كالطود العظيم
en: Then We inspired to Moses, "Strike with your staff the sea," and it parted, and each portion was like a great towering mountain.

source: وأزلفنا ثم الآخرين
en: And We advanced thereto the pursuers.

source: وأنجينا موسى ومن معه أجمعين
en: And We saved Moses and those with him, all together.

source: ثم أغرقنا الآخرين
en: Then We drowned the others.

source: واتل عليهم نبأ إبراهيم
en: And recite to them the news of Abraham,

source: إذ قال لأبيه وقومه ما تعبدون
en: When he said to his father and his people, "What do you worship?"

source: قالوا نعبد أصناما فنظل لها عاكفين
en: They said, "We worship idols and remain to them devoted."

source: قال هل يسمعونكم إذ تدعون
en: He said, "Do they hear you when you supplicate?

source: أو ينفعونكم أو يضرون
en: Or do they benefit you, or do they harm?"

source: قالوا بل وجدنا آباءنا كذلك يفعلون
en: They said, "But we found our fathers doing thus."

source: قال أفرأيتم ما كنتم تعبدون
en: He said, "Then do you see what you have been worshipping,

source: أنتم وآباؤكم الأقدمون
en: You and your ancient forefathers?

source: فإنهم عدو لي إلا رب العالمين
en: Indeed, they are enemies to me, except the Lord of the worlds,

source: الذي خلقني فهو يهدين
en: Who created me, and He [it is who] guides me.

source: والذي هو يطعمني ويسقين
en: And it is He who feeds me and gives me drink.

source: وإذا مرضت فهو يشفين
en: And when I am ill, it is He who cures me

source: والذي يميتني ثم يحيين
en: And who will cause me to die and then bring me to life

source: والذي أطمع أن يغفر لي خطيئتي يوم الدين
en: And who I aspire that He will forgive me my sin on the Day of Recompense."

source: رب هب لي حكما وألحقني بالصالحين
en: [And he said], "My Lord, grant me authority and join me with the righteous.

source: واجعل لي لسان صدق في الآخرين
en: And grant me a reputation of honor among later generations.

source: واجعلني من ورثة جنة النعيم
en: And place me among the inheritors of the Garden of Pleasure.

source: واغفر لأبي إنه كان من الضالين
en: And forgive my father. Indeed, he has been of those astray.

source: ولا تخزني يوم يبعثون
en: And do not disgrace me on the Day they are [all] resurrected -

source: يوم لا ينفع مال ولا بنون
en: The Day when there will not benefit [anyone] wealth or children

source: إلا من أتى الله بقلب سليم
en: But only one who comes to Allah with a sound heart."

source: وأزلفت الجنة للمتقين
en: And Paradise will be brought near [that Day] to the righteous.

source: وبرزت الجحيم للغاوين
en: And Hellfire will be brought forth for the deviators,

source: وقيل لهم أين ما كنتم تعبدون
en: And it will be said to them, "Where are those you used to worship

source: من دون الله هل ينصرونكم أو ينتصرون
en: Other than Allah? Can they help you or help themselves?"

source: فكبكبوا فيها هم والغاوون
en: So they will be overturned into Hellfire, they and the deviators

source: وجنود إبليس أجمعون
en: And the soldiers of Iblees, all together.

source: قالوا وهم فيها يختصمون
en: They will say while they dispute therein,

source: تالله إن كنا لفي ضلال مبين
en: "By Allah, we were indeed in manifest error

source: إذ نسويكم برب العالمين
en: When we equated you with the Lord of the worlds.

source: وما أضلنا إلا المجرمون
en: And no one misguided us except the criminals.

source: فما لنا من شافعين
en: So now we have no intercessors

source: ولا صديق حميم
en: And not a devoted friend.

source: فلو أن لنا كرة فنكون من المؤمنين
en: Then if we only had a return [to the world] and could be of the believers... "

source: كذبت قوم نوح المرسلين
en: The people of Noah denied the messengers

source: إذ قال لهم أخوهم نوح ألا تتقون
en: When their brother Noah said to them, "Will you not fear Allah?

source: إني لكم رسول أمين
en: Indeed, I am to you a trustworthy messenger.

source: فاتقوا الله وأطيعون
en: So fear Allah and obey me.

source: وما أسألكم عليه من أجر إن أجري إلا على رب العالمين
en: And I do not ask you for it any payment. My payment is only from the Lord of the worlds.

source: قالوا أنؤمن لك واتبعك الأرذلون
en: They said, "Should we believe you while you are followed by the lowest [class of people]?"

source: قال وما علمي بما كانوا يعملون
en: He said, "And what is my knowledge of what they used to do?

source: إن حسابهم إلا على ربي لو تشعرون
en: Their account is only upon my Lord, if you [could] perceive.

source: وما أنا بطارد المؤمنين
en: And I am not one to drive away the believers.

source: إن أنا إلا نذير مبين
en: I am only a clear warner."

source: قالوا لئن لم تنته يا نوح لتكونن من المرجومين
en: They said, "If you do not desist, O Noah, you will surely be of those who are stoned."

source: قال رب إن قومي كذبون
en: He said, "My Lord, indeed my people have denied me.

source: فافتح بيني وبينهم فتحا ونجني ومن معي من المؤمنين
en: Then judge between me and them with decisive judgement and save me and those with me of the believers."

source: فأنجيناه ومن معه في الفلك المشحون
en: So We saved him and those with him in the laden ship.

source: ثم أغرقنا بعد الباقين
en: Then We drowned thereafter the remaining ones.

source: كذبت عاد المرسلين
en: 'Aad denied the messengers

source: إذ قال لهم أخوهم هود ألا تتقون
en: When their brother Hud said to them, "Will you not fear Allah?

source: أتبنون بكل ريع آية تعبثون
en: Do you construct on every elevation a sign, amusing yourselves,

source: وتتخذون مصانع لعلكم تخلدون
en: And take for yourselves palaces and fortresses that you might abide eternally?

source: وإذا بطشتم بطشتم جبارين
en: And when you strike, you strike as tyrants.

source: واتقوا الذي أمدكم بما تعلمون
en: And fear He who provided you with that which you know,

source: أمدكم بأنعام وبنين
en: Provided you with grazing livestock and children

source: وجنات وعيون
en: And gardens and springs.

source: إني أخاف عليكم عذاب يوم عظيم
en: Indeed, I fear for you the punishment of a terrible day."

source: قالوا سواء علينا أوعظت أم لم تكن من الواعظين
en: They said, "It is all the same to us whether you advise or are not of the advisors.

source: إن هذا إلا خلق الأولين
en: This is not but the custom of the former peoples,

source: وما نحن بمعذبين
en: And we are not to be punished."

source: فكذبوه فأهلكناهم إن في ذلك لآية وما كان أكثرهم مؤمنين
en: And they denied him, so We destroyed them. Indeed in that is a sign, but most of them were not to be believers.

source: كذبت ثمود المرسلين
en: Thamud denied the messengers

source: إذ قال لهم أخوهم صالح ألا تتقون
en: When their brother Salih said to them, "Will you not fear Allah?

source: أتتركون في ما هاهنا آمنين
en: Will you be left in what is here, secure [from death],

source: في جنات وعيون
en: Within gardens and springs

source: وزروع ونخل طلعها هضيم
en: And fields of crops and palm trees with softened fruit?

source: وتنحتون من الجبال بيوتا فارهين
en: And you carve out of the mountains, homes, with skill.

source: ولا تطيعوا أمر المسرفين
en: And do not obey the order of the transgressors,

source: الذين يفسدون في الأرض ولا يصلحون
en: Who cause corruption in the land and do not amend."

source: قالوا إنما أنت من المسحرين
en: They said, "You are only of those affected by magic.

source: ما أنت إلا بشر مثلنا فأت بآية إن كنت من الصادقين
en: You are but a man like ourselves, so bring a sign, if you should be of the truthful."

source: قال هذه ناقة لها شرب ولكم شرب يوم معلوم
en: He said, "This is a she-camel. For her is a [time of] drink, and for you is a [time of] drink, [each] on a known day.

source: ولا تمسوها بسوء فيأخذكم عذاب يوم عظيم
en: And do not touch her with harm, lest you be seized by the punishment of a terrible day."

source: فعقروها فأصبحوا نادمين
en: But they hamstrung her and so became regretful.

source: فأخذهم العذاب إن في ذلك لآية وما كان أكثرهم مؤمنين
en: And the punishment seized them. Indeed in that is a sign, but most of them were not to be believers.

source: كذبت قوم لوط المرسلين
en: The people of Lot denied the messengers

source: إذ قال لهم أخوهم لوط ألا تتقون
en: When their brother Lot said to them, "Will you not fear Allah?

source: أتأتون الذكران من العالمين
en: Do you approach males among the worlds

source: وتذرون ما خلق لكم ربكم من أزواجكم بل أنتم قوم عادون
en: And leave what your Lord has created for you as mates? But you are a people transgressing."

source: قالوا لئن لم تنته يا لوط لتكونن من المخرجين
en: They said, "If you do not desist, O Lot, you will surely be of those evicted."

source: قال إني لعملكم من القالين
en: He said, "Indeed, I am, toward your deed, of those who detest [it].

source: رب نجني وأهلي مما يعملون
en: My Lord, save me and my family from [the consequence of] what they do."

source: فنجيناه وأهله أجمعين
en: So We saved him and his family, all,

source: إلا عجوزا في الغابرين
en: Except an old woman among those who remained behind.

source: ثم دمرنا الآخرين
en: Then We destroyed the others.

source: وأمطرنا عليهم مطرا فساء مطر المنذرين
en: And We rained upon them a rain [of stones], and evil was the rain of those who were warned.

source: كذب أصحاب الأيكة المرسلين
en: The companions of the thicket denied the messengers

source: إذ قال لهم شعيب ألا تتقون
en: When Shu'ayb said to them, "Will you not fear Allah?

source: أوفوا الكيل ولا تكونوا من المخسرين
en: Give full measure and do not be of those who cause loss.

source: وزنوا بالقسطاس المستقيم
en: And weigh with an even balance.

source: ولا تبخسوا الناس أشياءهم ولا تعثوا في الأرض مفسدين
en: And do not deprive people of their due and do not commit abuse on earth, spreading corruption.

source: واتقوا الذي خلقكم والجبلة الأولين
en: And fear He who created you and the former creation."

source: وما أنت إلا بشر مثلنا وإن نظنك لمن الكاذبين
en: You are but a man like ourselves, and indeed, we think you are among the liars.

source: فأسقط علينا كسفا من السماء إن كنت من الصادقين
en: So cause to fall upon us fragments of the sky, if you should be of the truthful."

source: قال ربي أعلم بما تعملون
en: He said, "My Lord is most knowing of what you do."

source: فكذبوه فأخذهم عذاب يوم الظلة إنه كان عذاب يوم عظيم
en: And they denied him, so the punishment of the day of the black cloud seized them. Indeed, it was the punishment of a terrible day.

source: وإنه لتنزيل رب العالمين
en: And indeed, the Qur'an is the revelation of the Lord of the worlds.

source: نزل به الروح الأمين
en: The Trustworthy Spirit has brought it down

source: على قلبك لتكون من المنذرين
en: Upon your heart, [O Muhammad] - that you may be of the warners -

source: بلسان عربي مبين
en: In a clear Arabic language.

source: وإنه لفي زبر الأولين
en: And indeed, it is [mentioned] in the scriptures of former peoples.

source: أولم يكن لهم آية أن يعلمه علماء بني إسرائيل
en: And has it not been a sign to them that it is recognized by the scholars of the Children of Israel?

source: ولو نزلناه على بعض الأعجمين
en: And even if We had revealed it to one among the foreigners

source: فقرأه عليهم ما كانوا به مؤمنين
en: And he had recited it to them [perfectly], they would [still] not have been believers in it.

source: كذلك سلكناه في قلوب المجرمين
en: Thus have We inserted disbelief into the hearts of the criminals.

source: لا يؤمنون به حتى يروا العذاب الأليم
en: They will not believe in it until they see the painful punishment.

source: فيأتيهم بغتة وهم لا يشعرون
en: And it will come to them suddenly while they perceive [it] not.

source: فيقولوا هل نحن منظرون
en: And they will say, "May we be reprieved?"

source: أفبعذابنا يستعجلون
en: So for Our punishment are they impatient?

source: أفرأيت إن متعناهم سنين
en: Then have you considered if We gave them enjoyment for years

source: ثم جاءهم ما كانوا يوعدون
en: And then there came to them that which they were promised?

source: ما أغنى عنهم ما كانوا يمتعون
en: They would not be availed by the enjoyment with which they were provided.

source: وما أهلكنا من قرية إلا لها منذرون
en: And We did not destroy any city except that it had warners

source: ذكرى وما كنا ظالمين
en: As a reminder; and never have We been unjust.

source: وما تنزلت به الشياطين
en: And the devils have not brought the revelation down.

source: وما ينبغي لهم وما يستطيعون
en: It is not allowable for them, nor would they be able.

source: إنهم عن السمع لمعزولون
en: Indeed they, from [its] hearing, are removed.

source: فلا تدع مع الله إلها آخر فتكون من المعذبين
en: So do not invoke with Allah another deity and [thus] be among the punished.

source: وأنذر عشيرتك الأقربين
en: And warn, [O Muhammad], your closest kindred.

source: واخفض جناحك لمن اتبعك من المؤمنين
en: And lower your wing to those who follow you of the believers.

source: فإن عصوك فقل إني بريء مما تعملون
en: And if they disobey you, then say, "Indeed, I am disassociated from what you are doing."

source: وتوكل على العزيز الرحيم
en: And rely upon the Exalted in Might, the Merciful,

source: الذي يراك حين تقوم
en: Who sees you when you arise

source: وتقلبك في الساجدين
en: And your movement among those who prostrate.

source: إنه هو السميع العليم
en: Indeed, He is the Hearing, the Knowing.

source: هل أنبئكم على من تنزل الشياطين
en: Shall I inform you upon whom the devils descend?

source: تنزل على كل أفاك أثيم
en: They descend upon every sinful liar.

source: يلقون السمع وأكثرهم كاذبون
en: They pass on what is heard, and most of them are liars.

source: والشعراء يتبعهم الغاوون
en: And the poets - [only] the deviators follow them;

source: ألم تر أنهم في كل واد يهيمون
en: Do you not see that in every valley they roam

source: وأنهم يقولون ما لا يفعلون
en: And that they say what they do not do? -

source: إلا الذين آمنوا وعملوا الصالحات وذكروا الله كثيرا وانتصروا من بعد ما ظلموا وسيعلم الذين ظلموا أي منقلب ينقلبون
en: Except those [poets] who believe and do righteous deeds and remember Allah often and defend [the Muslims] after they were wronged. And those who have wronged are going to know to what [kind of] return they will be returned.

source: طس تلك آيات القرآن وكتاب مبين
en: Ta, Seen. These are the verses of the Qur'an and a clear Book

source: هدى وبشرى للمؤمنين
en: As guidance and good tidings for the believers

source: الذين يقيمون الصلاة ويؤتون الزكاة وهم بالآخرة هم يوقنون
en: Who establish prayer and give zakah, and of the Hereafter they are certain [in faith].

source: إن الذين لا يؤمنون بالآخرة زينا لهم أعمالهم فهم يعمهون
en: Indeed, for those who do not believe in the Hereafter, We have made pleasing to them their deeds, so they wander blindly.

source: أولئك الذين لهم سوء العذاب وهم في الآخرة هم الأخسرون
en: Those are the ones for whom there will be the worst of punishment, and in the Hereafter they are the greatest losers.

source: وإنك لتلقى القرآن من لدن حكيم عليم
en: And indeed, [O Muhammad], you receive the Qur'an from one Wise and Knowing.

source: إذ قال موسى لأهله إني آنست نارا سآتيكم منها بخبر أو آتيكم بشهاب قبس لعلكم تصطلون
en: [Mention] when Moses said to his family, "Indeed, I have perceived a fire. I will bring you from there information or will bring you a burning torch that you may warm yourselves."

source: فلما جاءها نودي أن بورك من في النار ومن حولها وسبحان الله رب العالمين
en: But when he came to it, he was called, "Blessed is whoever is at the fire and whoever is around it. And exalted is Allah, Lord of the worlds.

source: يا موسى إنه أنا الله العزيز الحكيم
en: O Moses, indeed it is I - Allah, the Exalted in Might, the Wise."

source: وألق عصاك فلما رآها تهتز كأنها جان ولى مدبرا ولم يعقب يا موسى لا تخف إني لا يخاف لدي المرسلون
en: And [he was told], "Throw down your staff." But when he saw it writhing as if it were a snake, he turned in flight and did not return. [Allah said], "O Moses, fear not. Indeed, in My presence the messengers do not fear.

source: إلا من ظلم ثم بدل حسنا بعد سوء فإني غفور رحيم
en: Otherwise, he who wrongs, then substitutes good after evil - indeed, I am Forgiving and Merciful.
